# Analyzis Report II

## Properties types

In [1]:
import pandas as pd

data = pd.read_csv('data/aluguel.csv', sep=';')
data.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN

In [2]:
properties_type = data['Tipo']
properties_type

0                      Quitinete
1                           Casa
2        Conjunto Comercial/Sala
3                    Apartamento
4                    Apartamento
                  ...
32955                  Quitinete
32956                Apartamento
32957                Apartamento
32958                Apartamento
32959    Conjunto Comercial/Sala
Name: Tipo, Length: 32960, dtype: object

## Removing duplicates

In [3]:
# for remove duplicates have a two ways: 
# 1) We could call only unique values - this case return a ndarray
test  = properties_type.unique()
type(test)

# 2) we could remove duplicates - this case return a pandas.Series - So it's more advisable
test2 = properties_type.drop_duplicates()
type(test2)

# Here no need to create a new variable
properties_type.drop_duplicates(inplace = True)

## Organizing the visualization

In [4]:
properties_type = pd.DataFrame(properties_type)
properties_type.head(7)

                       Tipo
0                 Quitinete
1                      Casa
2   Conjunto Comercial/Sala
3               Apartamento
7        Casa de Condomínio
16           Prédio Inteiro
17                     Flat

In [5]:
properties_type.index

Int64Index([    0,     1,     2,     3,     7,    16,    17,    29,    80,
               83,   117,   159,   207,   347,   589,  2157,  3354,  4379,
             4721,  6983,  9687, 23614],
           dtype='int64')

In [6]:
properties_type.index = range(properties_type.shape[0])
# properties_type.index = range(len(properties_type)) -- Working too
properties_type.index

RangeIndex(start=0, stop=22, step=1)

In [7]:
properties_type.head()

                      Tipo
0                Quitinete
1                     Casa
2  Conjunto Comercial/Sala
3              Apartamento
4       Casa de Condomínio

## understanding column renaming

In [8]:
# There are two mods for renaming a column

# 1) this way is good for renaming columns
properties_type.columns = ['Type']
properties_type.head()

# 2) this way is good for renaming index 
properties_type.columns.name = 'Id'
properties_type.head()

Id                     Type
0                 Quitinete
1                      Casa
2   Conjunto Comercial/Sala
3               Apartamento
4        Casa de Condomínio